Tekla.Structures.Datatype.IDoubleDataType
The IDoubleDataType interface is an interface for the Tekla.Structures.Datatype.*
types whose value is a double.

Tekla.Structures.Datatype.IDoubleDataType.Value
The double value of the field.